# ðŸ”€ Pandas: SÄ±ralama ve SÄ±ralÄ± SeÃ§im

## ðŸ“Œ 1. data set

In [2]:
import pandas as pd

data = {
    "Ã‡alÄ±ÅŸan": ["Ali", "AyÅŸe", "Zeynep", "Murat", "Ahmet"],
    "Departman": ["Ä°K", "Finans", "Ä°K", "Finans", "BT"],
    "MaaÅŸ": [5000, 6000, 5200, 5800, 7000],
    "YaÅŸ": [28, 34, 26, 45, 39]
}

df = pd.DataFrame(data)
df

  Ã‡alÄ±ÅŸan Departman  MaaÅŸ  YaÅŸ
0     Ali        Ä°K  5000   28
1    AyÅŸe    Finans  6000   34
2  Zeynep        Ä°K  5200   26
3   Murat    Finans  5800   45
4   Ahmet        BT  7000   39

## âœ… 2. `sort_values()` â€“ SÃ¼tuna GÃ¶re SÄ±ralama

In [ ]:
# MaaÅŸa gÃ¶re artan sÄ±ralama
df.sort_values(by="MaaÅŸ")

In [ ]:
# MaaÅŸa gÃ¶re azalan sÄ±ralama
df.sort_values(by="MaaÅŸ", ascending=False)

In [ ]:
# Birden cox sÃ¼tuna gÃ¶re sÄ±ralama: Ã¶nce Departman, sonra YaÅŸ
df.sort_values(by=["Departman", "YaÅŸ"])

## âœ… 3. `sort_index()` â€“ Ä°ndekse GÃ¶re SÄ±ralama

In [ ]:
# VarsayÄ±lan index sÄ±ralamasÄ± (artÄ±rarak)
df.sort_index()

In [ ]:
# Ters index sÄ±ralamasÄ±
df.sort_index(ascending=False)

## ðŸ§  Mini GÃ¶revler

### 1. Ã‡alÄ±ÅŸanlarÄ± yaÅŸa gÃ¶re kÃ¼Ã§Ã¼kten bÃ¼yÃ¼ÄŸe sÄ±rala.

In [3]:
df.sort_values(by="YaÅŸ")

  Ã‡alÄ±ÅŸan Departman  MaaÅŸ  YaÅŸ
2  Zeynep        Ä°K  5200   26
0     Ali        Ä°K  5000   28
1    AyÅŸe    Finans  6000   34
4   Ahmet        BT  7000   39
3   Murat    Finans  5800   45

In [5]:
### 2. Departman sÄ±rasÄ±na gÃ¶re azalan, maaÅŸa gÃ¶re artan sÄ±rala.
df.sort_values(by="Departman", ascending=False).sort_values(by= "MaaÅŸ")

  Ã‡alÄ±ÅŸan Departman  MaaÅŸ  YaÅŸ
0     Ali        Ä°K  5000   28
2  Zeynep        Ä°K  5200   26
3   Murat    Finans  5800   45
1    AyÅŸe    Finans  6000   34
4   Ahmet        BT  7000   39

In [7]:
### 3. Ä°ndeksi ters Ã§evir.

df.sort_index(ascending= False)

  Ã‡alÄ±ÅŸan Departman  MaaÅŸ  YaÅŸ
4   Ahmet        BT  7000   39
3   Murat    Finans  5800   45
2  Zeynep        Ä°K  5200   26
1    AyÅŸe    Finans  6000   34
0     Ali        Ä°K  5000   28